; domain
(define (domain blocksworld)
    (:requirements :typing)
    (:types block robot)
    (:predicates 
        (on ?x - block ?y - block) ; observed predicate
        (ontable ?x - block)  ; derived predicate
        (clear ?x - block)  ; derived predicate
        (handempty ?x - robot)  ; derived predicate
        (handfull ?x - robot)  ; derived predicate
        (holding ?x - block) ; derived predicate
    )
    (:action pick_up
        :parameters (?x - block ?robot - robot)
        :precondition (and
            (clear ?x) 
            (ontable ?x) 
            (handempty ?robot)
        )
        :effect (and
            (not (ontable ?x))
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (holding ?x)
        )
    )
    (:action put_down
        :parameters (?x - block ?robot - robot)
        :precondition (and 
            (holding ?x)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (ontable ?x))
        )
    (:action stack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (holding ?x) 
            (clear ?y)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (on ?x ?y)
        )
    )
    (:action unstack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (on ?x ?y)
            (clear ?x)
            (handempty ?robot)
        )
        :effect (and 
            (holding ?x)
            (clear ?y)
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (not (on ?x ?y))
        )
    )
)

; problem
(define (problem blocksworld10)
(:domain blocksworld)
(:objects
    blue_block - block 
    arm - robot 
    yellow_block - block 
    red_block - block 
    orange_block - block 
    pink_block - block 
    green_block - block 
)

(:init
    ( clear blue_block )
    ( clear orange_block )
    ( clear pink_block )
    ( clear red_block )
    ( clear yellow_block )
    ( handempty arm )
    ( on orange_block green_block )
    ( ontable blue_block )
    ( ontable green_block )
    ( ontable pink_block )
    ( ontable red_block )
    ( ontable yellow_block )
)

    (:goal (and (on blue_block pink_block) (on pink_block red_block) (on yellow_block orange_block) (on orange_block green_block)))
)

; plan
1. (pick_up blue_block arm)
   deleted: (ontable blue_block) (clear blue_block) (handempty arm)
   added: (handfull arm) (holding blue_block)
   goals met: 1 of 4
2. (stack blue_block pink_block arm)
   deleted: (holding blue_block) (clear pink_block) (handfull arm)
   added: (clear blue_block) (handempty arm) (on blue_block pink_block)
   goals met: 2 of 4
3. (pick_up yellow_block arm)
   deleted: (ontable yellow_block) (clear yellow_block) (handempty arm)
   added: (handfull arm) (holding yellow_block)
   goals met: 2 of 4
4. (stack yellow_block orange_block arm)
   deleted: (holding yellow_block) (clear orange_block) (handfull arm)
   added: (clear yellow_block) (handempty arm) (on yellow_block orange_block)
   goals met: 3 of 4
5. (unstack blue_block pink_block arm)
   deleted: (clear blue_block) (handempty arm) (on blue_block pink_block)
   added: (holding blue_block) (clear pink_block) (handfull arm)
   goals met: 2 of 4
6. (put_down blue_block arm)
   deleted: (holding blue_block) (handfull arm)
   added: (clear blue_block) (handempty arm) (ontable blue_block)
   goals met: 2 of 4
7. (pick_up pink_block arm)
   deleted: (ontable pink_block) (clear pink_block) (handempty arm)
   added: (handfull arm) (holding pink_block)
   goals met: 2 of 4
8. (stack pink_block red_block arm)
   deleted: (holding pink_block) (clear red_block) (handfull arm)
   added: (clear pink_block) (handempty arm) (on pink_block red_block)
   goals met: 3 of 4
9. (pick_up blue_block arm)
   deleted: (ontable blue_block) (clear blue_block) (handempty arm)
   added: (handfull arm) (holding blue_block)
   goals met: 3 of 4
10. (stack blue_block pink_block arm)
   deleted: (holding blue_block) (clear pink_block) (handfull arm)
   added: (clear blue_block) (handempty arm) (on blue_block pink_block)
   goals met: 4 of 4
